In [9]:
import pandas as pd
df = pd.read_csv("zoo.csv")
df.head()

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320

In [ ]:
df.describe()

In [29]:
xyz_web={"Day":[1,2,3,4,5,6],"Visitors":[1000,700,6000,1000,400,350],"Bounce_Rate":[20,20,23,15,10,34]}
df = pd.DataFrame(xyz_web)
print(df)

   Day  Visitors  Bounce_Rate
0    1      1000           20
1    2       700           20
2    3      6000           23
3    4      1000           15
4    5       400           10
5    6       350           34

In [46]:
df1 = pd.DataFrame({"HP1":[80,90,70,60],"Int_rate":[2,1,2,3],"IND_GDP":[50,45,45,67]},index=[2001,2002,2003,2004])
df2 = pd.DataFrame({"HP1":[80,90,70,60],"Int_rate":[2,1,2,3],"IND_GDP":[50,45,45,67]},index=[2005,2006,2007,2008])
merge = pd.merge(df1,df2)
frames = [df1,df2]
res = pd.concat(frames)
print(res)

      HP1  Int_rate  IND_GDP
2001   80         2       50
2002   90         1       45
2003   70         2       45
2004   60         3       67
2005   80         2       50
2006   90         1       45
2007   70         2       45
2008   60         3       67

In [12]:
employees = [{'Name':'Naveen','EmpId':5042,'Sal':20251},
             {'Name':'Dinesh','EmpId':5043,'Sal':42000},
             {'Name':'Dileep','EmpId':5043,'Sal':21000},
             {'Name':'Harish','EmpId':5041,'Sal':26870},
             {'Name':'Siva','EmpId':5030,'Sal':36987},
             {'Name':'Sathish','EmpId':1364,'Sal':125871},
             {'Name':'Vishwanath','EmpId':5036,'Sal':32540}
]
df = pd.DataFrame(employees,ide)
df

         Name  EmpId     Sal
0      Naveen   5042   20251
1      Dinesh   5043   42000
2      Dileep   5043   21000
3      Harish   5041   26870
4        Siva   5030   36987
5     Sathish   1364  125871
6  Vishwanath   5036   32540